Revit 2027 API
View.HasDetailLevel Method
 Check if the view has a Detail Level property
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasDetailLevel()
Public Function HasDetailLevel As Boolean
public:
bool HasDetailLevel()
member HasDetailLevel : unit -> bool
Return Value
Boolean
 True if the view has a Detail Level, false otherwise
See Also
Reference
View Class
Autodesk.Revit.DB Namespace